src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РезервированиеГП/РезервированиеГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеГП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ДатыВыполненияПоПозициямЗНП/ДатыВыполненияПоПозициямЗНП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыВыполненияПоПозициямЗНП</name>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерЗНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыпускПродукции/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
Номер = ДанныеЗаполнения.Ссылка.Номер;
Подразделение = ДанныеЗаполнения.ДокументОснование.Подразделение;
ДокументОснование = ДанныеЗаполнения.Ссылка;
КонецПроцедуры

Процедура УстановитьДатуГрупповойУпаковки(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	ПЗ.ДатаГрупповойУпаковки = ТекущаяДата();
	ПЗ.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
МТК = ДокументОснование.ДокументОснование;
МестоХраненияКанбанов = ДокументОснование.Линейка.МестоХраненияКанбанов;
// регистр ПередачиВПроизводство
Движения.ПередачиВПроизводство.Записывать = Истина;
// регистр МестаХранения Приход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = Списание.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Требуется = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда
			Если Не ТЧ.МПЗ.Канбан.Пустая() Тогда	
				Если Не ТЧ.МПЗ.Канбан.РезервироватьВПроизводстве Тогда		
				КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияКанбанов,ТЧ.МПЗ,Дата);
					Если КолОстаток >= Требуется Тогда
					Движение = Движения.МестаХранения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.МестоХранения = МестоХраненияКанбанов;
					Движение.ВидМПЗ = ТЧ.ВидМПЗ;
					Движение.МПЗ = ТЧ.МПЗ;
					Движение.Количество = Требуется;
					Иначе
					Отказ = Истина;
					Сообщить("Канбан без резервирования "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт на складе: "+Строка(Требуется-КолОстаток)+" (Оформите излишки!)");
					КонецЕсли; 		
				Продолжить; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПП(ДокументОснование,ТЧ.ВидМПЗ,ТЧ.МПЗ,Дата);	
		Если КолОстаток >= Требуется Тогда
		Движение = Движения.ПередачиВПроизводство.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Документ = ДокументОснование;
		Движение.ВидМПЗ = ТЧ.ВидМПЗ;
		Движение.МПЗ = ТЧ.МПЗ;
		Движение.Количество = Требуется;
		Иначе
		Отказ = Истина;
		Сообщить("МПЗ: "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт в производстве: "+Строка(Требуется-КолОстаток));
		КонецЕсли;				 	
	КонецЦикла;
		Если Отказ Тогда
		Возврат;
		КонецЕсли; 
			Если НаСклад Тогда
			// регистр МестаХранения выпуск продукции
			Движения.МестаХранения.Записывать = Истина;
			// регистр ПланыВыпуска выпуск готовой продукции
			Движения.ПланыВыпуска.Записывать = Истина;
			// регистр РезервированиеГП приход	
			Движения.РезервированиеГП.Записывать = Истина;
				Для Каждого ТЧ Из Поступление Цикл
				Движение = Движения.МестаХранения.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.МестоХранения = МестоХранения;
				Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
				Движение.МПЗ = ТЧ.Номенклатура;
				Движение.Количество = ТЧ.Количество;
				
				КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(Дата,МТК);
					Если КолОстПВ >= ТЧ.Количество Тогда
					Движение = Движения.ПланыВыпуска.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Подразделение = Подразделение;
					Движение.Линейка = МТК.Линейка;
					Движение.Номенклатура = ТЧ.Номенклатура;
					Движение.МаршрутнаяКарта = МТК;
					Движение.Количество = ТЧ.Количество; 
					ДокОснМТК = МТК.ДокументОснование;
						Если ЗначениеЗаполнено(ДокОснМТК) Тогда
							Если ТипЗнч(ДокОснМТК) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
							Движение = Движения.РезервированиеГП.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
							Движение.Период = Дата;
							Движение.МестоХранения = МестоХранения;
							Движение.Продукция = ТЧ.Номенклатура;
							Движение.Документ = ДокОснМТК;
							Движение.Количество = ТЧ.Количество;
								Если КолОстПВ = ТЧ.Количество Тогда
								КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоЗаказуНаПроизводство(ДокОснМТК,ТЧ.Номенклатура,Дата);
									Если КолОстаток = МТК.Количество Тогда
										Если Не ДокОснМТК.ВнутренниеСчета Тогда
										ДВПЗ = РегистрыСведений.ДатыВыполненияПоПозициямЗНП.СоздатьМенеджерЗаписи();
										ДВПЗ.НомерЗНП = ДокОснМТК.Номер;
										ДВПЗ.КодТовара = ТЧ.Номенклатура.Товар.Код;
										ДВПЗ.ДатаВыполнения = Дата;
										ДВПЗ.ЗапрещеноКОтгрузке = ТЧ.Номенклатура.ЗапрещеноКОтгрузке;
										ДВПЗ.Записать(Истина);
										КонецЕсли; 
									КонецЕсли;
								КонецЕсли;
							ИначеЕсли ТипЗнч(ДокОснМТК) = Тип("ДокументСсылка.СписаниеМПЗПрочее") Тогда
								Если ТипЗнч(ДокОснМТК.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
								Движение = Движения.РезервированиеГП.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Период = Дата;
								Движение.МестоХранения = МестоХранения;
								Движение.Продукция = ТЧ.Номенклатура;
								Движение.Документ = ДокОснМТК.ДокументОснование;
								Движение.Количество = ТЧ.Количество;
									Если КолОстПВ = ТЧ.Количество Тогда
									КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоЗаказуНаПроизводство(ДокОснМТК.ДокументОснование,ТЧ.Номенклатура,Дата);
										Если КолОстаток = МТК.Количество Тогда
											Если Не ДокОснМТК.ДокументОснование.ВнутренниеСчета Тогда
											ДВПЗ = РегистрыСведений.ДатыВыполненияПоПозициямЗНП.СоздатьМенеджерЗаписи();
											ДВПЗ.НомерЗНП = ДокОснМТК.ДокументОснование.Номер;
											ДВПЗ.КодТовара = ТЧ.Номенклатура.Товар.Код;
											ДВПЗ.ДатаВыполнения = Дата;
											ДВПЗ.ЗапрещеноКОтгрузке = ТЧ.Номенклатура.ЗапрещеноКОтгрузке;
											ДВПЗ.Записать(Истина);
											КонецЕсли; 
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
							Если КолОстПВ = ТЧ.Количество Тогда
							МТКОбъект = МТК.ПолучитьОбъект();
							МТКОбъект.Статус = 3;
							МТКОбъект.Записать(РежимЗаписиДокумента.Проведение);
								Если ТЧ.Номенклатура.Товар.ТоварнаяГруппа.ГрупповаяУпаковка Тогда
								УстановитьДатуГрупповойУпаковки(ДокументОснование.ДокументОснование); 
								КонецЕсли;
							КонецЕсли; 
					Иначе
					Отказ = Истина;
					Сообщить("Изделие: "+СокрЛП(ТЧ.Номенклатура.Наименование)+" выпускается: "+ТЧ.Количество+", недостаёт в МТК: "+Строка(ТЧ.Количество-КолОстПВ));
					КонецЕсли; 
				КонецЦикла;	
			Иначе
			// регистр ПередачиВПроизводство выпуск полуфабрикатов
			Движения.ПередачиВПроизводство.Записывать = Истина;
				Для Каждого ТЧ Из Поступление Цикл
				Движение = Движения.ПередачиВПроизводство.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Документ = ДокументОснование;
				Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
				Движение.МПЗ = ТЧ.Номенклатура;
				Движение.Количество = ТЧ.Количество;
				КонецЦикла;	
			КонецЕсли; 	
КонецПроцедуры
